//Напишите программу, которая принимает на вход координаты двух точек и 
// находит расстояние между ними в 2D пространстве

// А(3,6);В(2,1)->5,09
// А(7,-5);В(1,-1)->7,21
Console.WriteLine("Hello, World!");
